In [2]:
%pip install pandas

Requirement already satisfied: pandas in c:\users\g_gyuuuuuu\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\g_gyuuuuuu\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\g_gyuuuuuu\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\g_gyuuuuuu\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\g_gyuuuuuu\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\g_gyuuuuuu\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [15]:
import pandas as pd

In [16]:
growth = pd.Series([143,150,157,160], index=["2018", "2019", "2020", "2021"])
growth

2018    143
2019    150
2020    157
2021    160
dtype: int64

In [10]:
growth["2018"]

143

In [ ]:
# 아래 하단 두가지 방법, 표형태의 칼럼 두개를 뽑아내기

In [17]:
index=["2018", "2019", "2020", "2021"]
data = {
    "영희" : [143, 150, 157, 160],
    "철수" : [165,172,175,180]
}
growth = pd.DataFrame(data, index = index)
growth

       영희   철수
2018  143  165
2019  150  172
2020  157  175
2021  160  180

In [17]:
index=["2018", "2019", "2020", "2021"]
Y = pd.Series([143,150,157,160], index = index)
C = pd.Series([165,172,175,180], index = index)
growth = pd.DataFrame({
    "영희" : Y,
    "철수" : C
})
growth

       영희   철수
2018  143  165
2019  150  172
2020  157  175
2021  160  180

In [19]:
print(growth.dtypes)

영희    int64
철수    int64
dtype: object

In [21]:
growth.astype('float') # 잠깐 바꾸기. 진짜로 바꾸고 싶다면 = 표시 하면 가능.

         영희     철수
2018  143.0  165.0
2019  150.0  172.0
2020  157.0  175.0
2021  160.0  180.0

In [24]:
print(growth.dtypes)

영희    int64
철수    int64
dtype: object

In [26]:
growth.astype({'영희':'float'})  # 특정 칼럼 변경 가능

         영희   철수
2018  143.0  165
2019  150.0  172
2020  157.0  175
2021  160.0  180

In [28]:
# pd.read_csv("파일명")
pd.read_csv("2.csv")

   Unnamed: 0   A   B  C
0           0  30  21  9
1         100   2   3  1

In [30]:
pd.read_csv("2.csv", index_col=1)

    Unnamed: 0   B  C
A
30           0  21  9
2          100   3  1

In [37]:
ab = pd.Series(["1","2","3"], index=['a','b','c'], name = 'project')
ab

a    1
b    2
c    3
Name: project, dtype: object

In [ ]:
# 특정 파일의 자료를 읽을 수 있음음
# reviews = pd.read_cvs("특정 자료의 경로", index_col =0) 
# 0말고 1,2도 있음, 원하는 칼럼으로 변경 가능.

In [41]:
growth.to_csv("ouput.csv") # 특정 .csv 파일 새로 저장하는 법, growth에 대해 저장함.

In [9]:
# 표에서 특정 라인을 보고 싶다면 다음과 같음
# growth[라인]
# growth.라인

In [56]:
index=["2018", "2019", "2020", "2021"]
data = {
    "영희" : [143, 150, 157, 160],
    "철수" : [165,172,175,180],
    "영 철" : [123,456,789,000]
}
growth = pd.DataFrame(data, index = index)
growth

       영희   철수  영 철
2018  143  165  123
2019  150  172  456
2020  157  175  789
2021  160  180    0

In [35]:
growth["영희"][1:] # 이런식으로 리스트처럼 사용도 가능

2019    150
2020    157
2021    160
Name: 영희, dtype: int64

In [23]:
growth. 영희

2018    143
2019    150
2020    157
2021    160
Name: 영희, dtype: int64

In [31]:
growth["영 철"]    #만약 이름에 띄어쓰기가 있다면 이렇게 따옴표와 띄어쓰기기가 들어가야함.

2018    123
2019    456
2020    789
2021      0
Name: 영 철, dtype: int64

In [32]:
growth.iloc[0] # 0은 첫번째 행행

영희     143
철수     165
영 철    123
Name: 2018, dtype: int64

In [34]:
growth.iloc[1] # 1은 두번째 행을 의미함.

영희     150
철수     172
영 철    456
Name: 2019, dtype: int64

In [37]:
growth.iloc[:2, 0]

2018    143
2019    150
Name: 영희, dtype: int64

In [40]:
growth.iloc[2:]#왼쪽 맨위 4칸

      영 철
2020  789
2021    0

In [41]:
growth.iloc[-2:,-2:]  # 오른쪽 아래 4칸칸

       철수  영 철
2020  175  789
2021  180    0

In [49]:
growth.iloc[2:,1:]

       철수  영 철
2020  175  789
2021  180    0

In [52]:
growth.iloc[-2:] # 뒤에서 2번째행부터 마지막까지 출력

       영희   철수  영 철
2020  157  175  789
2021  160  180    0

In [53]:
# growth.iloc[행이고 열이다.]

In [60]:
# 레이블 0번째 행의 영희가 뭐냐?
growth.loc['2020', '영희']     # 이건 loc라는거 헷갈리지 말것것

157

In [62]:
growth.loc['2021']

영희     160
철수     180
영 철      0
Name: 2021, dtype: int64

In [64]:
growth.loc[:,'영희'] # 모든 행의 영희에 대한 값 구하기

2018    143
2019    150
2020    157
2021    160
Name: 영희, dtype: int64

In [65]:
# iloc  
# loc

In [68]:
growth.loc[:,["영희","영 철"]]  # 영희와  영 철이의 결과값을 보고 싶다면>
# : 이거는 모든 행

       영희  영 철
2018  143  123
2019  150  456
2020  157  789
2021  160    0

In [73]:
growth.loc[["2018", "2020"], ["영희", "영 철"]] 
# 이것과 아래 값이 동일한데, 이게 loc와 lioc의 차이점

       영희  영 철
2018  143  123
2020  157  789

In [75]:
growth.iloc[[0,2],[0,2]]

       영희  영 철
2018  143  123
2020  157  789

In [79]:
# 18년도부터 20년도까지 보는법
growth.loc["2018":"2020"]

       영희   철수  영 철
2018  143  165  123
2019  150  172  456
2020  157  175  789

In [82]:
# 영희에서 철수까지 그리고 18년도부터 20년도까지지
growth.loc["2018":"2020","영희":"철수"]

       영희   철수
2018  143  165
2019  150  172
2020  157  175

In [87]:
# iloc로 한다면?
growth.iloc[0:3,0:2]

       영희   철수
2018  143  165
2019  150  172
2020  157  175

In [90]:
# set_index 사용하기, 특정 칼럼을 인덱스로 사용함.
growth.set_index('영희')

      철수  영 철
영희
143  165  123
150  172  456
157  175  789
160  180    0

In [92]:
# 조사식, 예) a > 4
# 영희를 기준으로 150이상인걸 출력하기,
# 영희만 나오는 건 아니고 영희를 기준으로 150이상 값이 출력됨.
growth.loc[growth.영희>150]

       영희   철수  영 철
2020  157  175  789
2021  160  180    0

In [96]:
# 영희의 내용만 출력하고 싶다면
growth.loc[growth.영희>150].영희

2020    157
2021    160
Name: 영희, dtype: int64

In [98]:
# 영희의 값에서 진실 혹은 거짓을 나타내는 값 출력하기기
growth.영희 >150

2018    False
2019    False
2020     True
2021     True
Name: 영희, dtype: bool

In [104]:
# 배치 변경, 가로로 하고 싶다면? 그냥 바꿔서 넣기
index=["영희", "철수", "영철"]
data = {
    "2018" : [145,165, 170],
    "2019" : [150,172,177],
    "2020" : [157,175,180]
}
growth = pd.DataFrame(data, index = index)
growth

    2018  2019  2020
영희   145   150   157
철수   165   172   175
영철   170   177   180

In [106]:
# 19년도에 150인 값 찾기
growth.loc[growth["2019"]==150]

    2018  2019  2020
영희   145   150   157

In [108]:
# 변경하고 싶은거 바꾸기
growth["2019"] =190

In [110]:
# 추가하고 싶은거 바꾸기
growth["2021"] = 200

In [112]:
print(growth)

    2018  2019  2020  2021
영희   145   190   157   200
철수   165   190   175   200
영철   170   190   180   200

In [115]:
# 거꾸로 추가해서 growth의 길이만큼 값 입력해서 넣기
growth["거꾸로"] = range(len(growth),0, -1)
print(growth)

    2018  2019  2020  2021  거꾸로
영희   145   190   157   200    3
철수   165   190   175   200    2
영철   170   190   180   200    1